[
{"title": "LG 22 inch (55cm) IPS Monitor - Full HD, IPS Panel with VGA, HDMI, DVI, Audio Out Ports - 22MP68VQ", "brand": "LG", "rating": "4.4 out of 5 stars", "price": "₹ 7,999.00", "colour": "not defined", "instock": true, "reviews": ["The problem is in the picture clarity. The left half is absolutely excellent but not on the other side, some yellowish color which dulls the monitor. Have called LG Customer care for service and awaiting his presence to sort out this issue. If not I will soon return the product.", "Update: The service person convincing that it is nature quality of the light reflected which appears in white background. Yes, couldn't able to find any yellowish while playing videos. But, still it looks awkward. I usually work with white background software where I do not prefer this rile thing. I'm returning this LG monitor. Thanks to LG and Amazon for this awful experience.", "Replaced Product Update: Now Amazon making me not to buy their products.", "1. Seal is broken and revamped.", "2. There is a bulge/ bump in the frame of the screen.", "Returning this frustrating product. And I want my money back.", "I think this is my last purchase from Amazon.", "@Amazon, Don't play with LG brand, LG has lost one loyal customer because of you.", "This is a splendid product. Very to-the-point approach from the manufacturing perspective. One of the best price-to-performance ratio.", "Pros:", "1. Freesync is supported. This means if you are using an AMD graphics card, your refresh rate automatically shoots beyond the 60Hz limit.", "2. Reader/Custom modes are available. As a user who uses the PC for gaming along with web browsing, movie watching, programming, a reader mode is very much required. Prolonged exposure to vibrant and bright colors are not always the best fit for programming. This monitor takes care of that.", "3. Comes with a decent HDMI male-to-male connector. The cable quality might not be world-class but does a decent job of responsive video data transfer, when it comes to quick display changes (like gaming).", "4. Minimal bezel at the edges.", "5. Beautiful and faithful color representations.", "Cons:", "1. No horizontal swivel. This is a minor nice-to-have feature. However, the monitor does have adjustable vertical swiveling, which makes up for the missing feature.", "2. The main monitor control button (at the bottom base) is a little cumbersome to handle. This could have been better designed.", "Two things to take note of:", "A. If Freesync is turned on, you might have difficulties getting into BIOS as many motherboards do not support displays beyond 60Hz. It's kinda stupid but worth knowing", "B. For the programmers: This is a normal DPI monitor (meaning the Dots-Per-Inch is 96 and so, it does not fall into the high-DPI category). This is just an information. This does not mean that the monitor is good or bad. Just that it is a normal DPI monitor.", "All in all, a great monitor. I could not find anything to reduce even a half star from the product rating. 5 stars from me. Been using this for more than two weeks now.", "This is a good 1080p monitor at this price:", "i have purchased it @8199 during sale, and i feel it just worth it considering the price the product is well build comes with max 2 years of Warranty do read all the warranty related information on LG website or on the warranty card>", "the Monitor comes with a HDMI port, by default i remain on 60Hz but if u want u cant take it upto 75Hz (u need a AMD card running on HDMI with AMD free sync On)", "colors are pre-calibrated but the coverage is only 75% of the color gamut", "contrast ratio is also good", "Dont Get Confused about this Monitor This is a IPS LED montior Not LCD as its written on product name(for a moment i got confused with that)", "It is not entirely bezel less there is a small bezel but its  doesn't looks bad!", "if you are planning to buy this monitor go with!", "Hope these informations would be helpful to you all.. !", "Excellent monitor at this price range .display is really nice and the colors are all really vibrant. It supports freesync and upto 75Hz refresh rate. You get an HDMI cable too, even though I didn't see it being mentioned in the product page. I am fully satisfied after buying such affordable and budget range Full HD LED Monitor.", "Cons:", "1. Glossy plastic back and stand finish attract lot of fingerprints", "2. Stand can only tilt, there is no height adjustment or rotation feature", "3. Only one HDMI Port", "4: No Speakers and USB port"], "description": ["Screen Size: 22 inch (54.61 cm) Full HD (1920 X 1080) Borderless IPS Panel", "Connectivity Port: 1 VGA Port, 1 HDMI Port, 1 DVI Port, 1 Audio-Out Port, 1 Headphone Port", "Aspect Ratio: 16:9, Brightness (Typical): 250 cd/m², Consumption( Normal On(EPA)): 13.7W", "Refresh Rate: 60 Hz, Response Time: 5 ms", "Viewing Angle: 178 degree horizontal 178 degree vertical", "Enjoy Smoother Game Play", "Wall Mount: Yes", "Flicker Free Technology: Yes", "Warranty: 3 Years", "Intelligent Auto (Auto Adjustment): Yes"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61wFnp19zzL._SL1092_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/61wFnp19zzL._SL1092_.jpg", "path": "full/0dfd30631ac178bbf9cbb562cfc08e82218f8d83.jpg", "checksum": "b5abaf7e4fcb5b4e6a803d566cd08975"}]},
{"title": "Lenovo L22e-20, 21.5 inch Monitor with LED Display, VA Panel, AMD Free Synch, (HDMI and VGA inputs), Raven Black", "brand": "Lenovo", "rating": "4.3 out of 5 stars", "price": "₹ 7,199.00", "colour": "not defined", "instock": true, "reviews": ["I had lg22mp68vq before this monitor which i dropped unfortunately. This lenovo monitor is slim and looks pretty good but i feel lg22mp68vq is a better monitor. It looked better than this and acreen looked bigger aswell because of the black bezels.", "The user interface is also not as good as the LG monitor. This monitor is pretty good but not as good as the one i previously had. I only went for this lenovo monitor because i didnt want to buy the same monitor again.", "Adding some pictures.", "Every thing is very good but little bit disappointed with frame .there is gap between screen and frame", "This is a nice monitor, plain and simple, but being so inexpensive makes it a must buy. No need to spend more. Excellent response time and refresh rates, solid construction (heavy, quality feel), and dependable. What's not to like?. Plus you get a free HDMI cable and a VGA Cable also", "I have awarded 4 stars because I got a defective one at first. There was a dead/stuck pixel around the center. At dark backgrounds it was noticeable. I ran udpixel  software and confirmed it was a stuck pixel. However the seller very quickly delivered a replacement.", "The build quality and resolution is good. Mounting the monitor to the stand is simple but may take a while to be locked properly. The matte anti glare screen is perfect for professional users. I have a ryzen 5 2400g and happy to see amd freesync turned on.  Tweaking the brightness and calibrating the settings for optimal use is a must for any monitor. It's a good purchase at this price point.", "I have MI 55inch 4K HDR tv ,but as a online gamer ,I don’t like playing on tv ,previously I had lg 22inch monitor which was great ,but this Lenovo is new in market ,so I ordered ,,now I have connected to my xbox one x ,,I am loving it ,amazing colours ,contrast is superb ,overall I am in love with this monitor ! Thank you amazon for giving me such a beautiful monitor", "An Excellent Product/Monitor at this Price Point. Haven't noticed much difference in screen size(i am using the lg 22mp too).Picture Quality i guess is better in My Lenovo than My Lg,again that's up to different user.Audio Out-put is quite Bad/low(No body uses Monitor speakers,are u dumb enough to use?).Thin Side Bezels with a lower chick.Mounting is a bit confusing(took me over 2hr to figure-out for my own dumbness),so just drag the lock down,put the stand in the monitor socket and there you go.Bleeding is no where noticeable compared to my Lg 22mp. And lastly It's a 75hz display while the Lg one is 60hz,So Better Gaming performance than Lg.", "After using only laptop screen for a while, I bought this to have a easier view. I didn't want to spend too much. So a range of 8.5k was suitable for me.", "Quite happy with the purchase, picture quality is very nice. I checked with 4K videos and its awesome. I have not used it for games, so no idea about that.", "Beautiful display at budget pricing great for productivity and work has different screen modes to fit your requirements won't suggest it for e-sports gaming like fortnite as response time is a bit less", "Only con I would say is the plastic frame in the buttons area has creaking issues otherwise it's a great display color are vibrant and viewing angles are great too"], "description": ["21.5 inch screen, 1920 x 1080 pixels display", "LED display with VA panel, 178 degree viewing angle", "2mm thin Raven black bazel", "The TÜV Low Blue Light certification and flicker-free display reduce eye strain and offer an unimpeded visual experience.", "The AMD FreeSync technology prevents frame-tearing and ensures no new frames are drawn during the refresh period", "The monitor also reduces distracting reflections and maintains image quality even when you view the display from different angles."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61ThXwFY7-L._SL1125_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/61ThXwFY7-L._SL1125_.jpg", "path": "full/137e96e8ebc90960f1cd9bae8e8d8d45e382ffca.jpg", "checksum": "d9b6dadf2721c54b60d7963603d504c2"}]},
{"title": "BenQ GW2470HL 23.8-inch (60.45 cm) Thin Bezel LED Backlit Monitor-Full HD, VA Panel with VGA, Dual HDMI, Heaphone Ports, Eye Care Technology - M353497 (Black)", "brand": "BenQ", "rating": "4.2 out of 5 stars", "price": "₹ 7,599.00", "colour": "not defined", "instock": true, "reviews": ["Very nice product i really appreciate the product,worth buy it.the resolution is 1920*1080.2 HDMI ports for attaching monitor.And low light feature is too good for eyes. worth buying it.", "Loved it.... awesome....my old vl2040 benq got some panel lines so I chose benq once again.... that too at 7800 rupees I got 24 inch full hd VA panel.. got 3 types of input connector VGA, DVI , HDMI and with speakers and audio line in also.... viewing angles are too fine....played games like sniper elite 4 and visual quality was too rich....for those who  says HDMI not detected should read the manual or see you tube...you should select HDMI auto detection in monitor menu. Not expecting more...got more than expected. Got irritated by local delivery guy. not delivered as they committed (12-1pm) one time and delayed delivery till 2.55pm....had to wait for them without doing other work in that time...Enjoying watching movies", "The product image quality look good. I am upgrading my 2008 Benq monitor. It serves the purpose . It has 2 hdmi output , one vga and one audio out. It has automatic hdmi port detecting but you have to turn it on in settings. I am connected it with ps3 and a TV box . The video looks good. No problems detected as of now. I will update if something happens. Hope this help", "Purchased for 7600 !! Thanks Amazon. Great monitor. Don't be confused about VA vs IPS. It uses AVA panel which produced great vibrant colors with adantage of great contrast and price over IPS. Factory color calibration are basic , You must calibrate its colors before blaming it.", "clear black, good colour reproduction, easy switching between HDMI connectors,", "cable delivered not indian style, but fits well in spike guard", "happy, satisfied", "i received damaged product then i had to get it exchange...even after exchanging i received a defective product...hdmi port was not working it was showing no cables connected!! Not trustworthy!!", "If you plan to buy this for multi screen then I don't recommend this. (display color is not consistent. brought it for dual setup but  I could see different color.", "+ Black levels are lovely since this is a VA panel", "+ Because of great black levels, you can expect really good contrast ratio out of this, which really helps the colors pop.", "+ No backlight bleed at all which is a plus. Most budget monitors suffer from backlight bleed, but VA panels don't show this problem.", "+ The colors are really nice considering the price. Not a match for IPS LCD, but the colors are good paired with high contrast makes for a great viewing experience, especially for games which have a lot of dark scenes.", "+ Gaming is reasonably good. VA panels are not particularly known for their response times, but if you are a casual gamer, then you won't notice any difference compared to other panels in this price range.", "All in all, a great buy and easily worth the money I paid for it. Great buy for under 9k. Go for it."], "description": ["Screen Size: 23.8 inch (60.4 cm) Full HD (1920 X 1080) Thin Bezel VA Panel", "Connectivity Port: 1 VGA Port, 2 HDMI Ports, 1 Headphone Port", "Aspect Ratio: 16:9, Brightness (Typical): 250 cd/m²", "Refresh Rate: 60 Hz, Response Time: 4 ms", "Viewing Angle: 178 degree horizontal 178 degree vertical", "Flicker Free Technology: Yes, Low Blue Light Technology: Yes"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/81GSxVoEWHL._SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/81GSxVoEWHL._SL1500_.jpg", "path": "full/729361f43fd675bef6a3fe6e3ffaed74a06de7a1.jpg", "checksum": "65acb67da19caf1795ac3b42711854d3"}]},
{"title": "BenQ GW2270H 21.5-inch (54 cm) Slim Bezel LED Monitor-Full HD, VA Panel with VGA, Dual HDMI Ports, Eye Care Technology, TCO Certified - M352983 (Black)", "brand": "BenQ", "rating": "4.4 out of 5 stars", "price": "₹ 6,899.00", "colour": "not defined", "instock": true, "reviews": ["Benq GW2270H is an awesome budget monitor.. got it for rs 7299 in the great indian sale..", "the monitor is good for everything, office work, gaming, movie watching, and what not..", "PROS", "VA Panels like this have aweome contrast ratio and does not have any backlight bleed like IPS monitors, so while watching movies, blacks will appear black and not greyish", "Great viewing angles, it wont seem like negatives as it happens when you see from sides in TN monitors", "Blue light filter helps while long working and gaming sessions :D", "2 hdmi and 1 vga port for connectivity, alongwith an aux cable port for audio which works only if you use an hdmi cable", "The monitor is VESA mountable", "CONS", "these aren't cons, just a few basic adjustments", "The monitor by default will recognise a vga input first and then it can be changed to hdmi in settings.. besides there's an option to enable auto switch between the hdmi and vga, so one can enable that :)", "Settings -- Input -- HDMI 1 or HDMI 2 port as chosen", "HDMI cable not provided, was hopeful that there would be one as new graphics cards hardly have a vga port these days, but I bought one..", "all in all its an awesome monitor.. love it.. a worthy upgrade..", "P.S. if you already have a 18.5 inch monitor, buy the 24 inch variant :D", "What an awesome monitor(GW2270HM) at a steal deal price,crisp and clear display , with all three ports vga ,HDMI,dvi. Speakers are not that loud but gets the job done for regular activities.", "Got it for only 7300 which is actually the price of the lower end GW2270 model ,I am so satisfied!!!", "[Edit after 3 days: Thanks to Appario for replacing the defective monitor. The new monitor is up to the mark with BenQ's trusted and proven old models. The rest of the review below is about a defective unit.]", "I had the impression that BenQ is the unsung hero in the monitor market, providing great monitors at affordable price. I still own one working 15\" beige TFT BenQ monitor from 2004 and a BenQ GW2255 from 2013 both of which have superb display quality. This model GW2270 does not uphold BenQ's old reputation. This one has a topple-safe stand and signal detection time is better, but the display is not great for reading. Adjusting the sharpness, color balance, gamma, disabling AMA, nothing helps to make the display as crisp & sharp as the GW2255 (both were connected through DVI at 1080p). To make matters worse, the right side of the monitor is bleeding light (look at the attached photo carefully) and it is far brighter than the center of the monitor. The bleeding stays the same even if I move 3 meters away, so it is not a VA panel characteristic. The bleeding is less noticeable while watching movies.", "It has dual HDMI ports and a VGA port and a stereo out. You can use this as a smart tv through chrome or prime stick provided if you connect audio port to a small sound bar. The only doubt i had is whether it's really a led monitor. No where it is written as led and in manual it is written as LCD display only. Black is not displayed as clear black. It's bit greyish", "I have never seen such a blurred display in my life..The reason this monitor was sold at such a low price is because of its pathetic display...horrible colours and very poor sharpness..my 10 year old samsung moniter had better sharpness than this..returned this product not worth it at all..", "After I bought it, the price dropped by 1000 rupees.", "Good monitor. Sharp. Handles gaming and text well, at least at my level of use. Some advanced options like hue and saturation are disabled in the monitor settings.", "And this is a 2 year old product. Made in 2016.", "Satisfied. But thinking that I may have chosen something better at a cheaper rate if I had more experience in purchasing hardware.", "Pros :", "1. Sturdy and good looking monitor", "2. Good on eyes.", "Cons :", "1. Very weak speakers", "2. Colors look washed out compared to IPS displays. Best for office purposes, not for media and gaming.", "The best monitor to buy, it's sturdy and strong. Unlike most of the monitors this monitor favors sturdiness rather than sleekness which is a good thing. It's better to have a slightly thick monitor than super thin monitor which had to be kept like a glass sheet which could get damages with even a slight impact.", "And when it comes to picture quality and brightness everything is up to the mark", "This monitor has a VA panel I think which is better than an IPS panel because the blacks on this monitor looks way black than any other IPS monitor.", "THIS IS A TOP CLASS PRODUCT. JUST GO FOR IT"], "description": ["Screen Size: 21.5 inch (54.6 cm) Full HD (1920 X 1080) Slim Bezel VA Panel", "Connectivity Port: 1 VGA Port, 2 HDMI Ports", "Aspect Ratio: 16:9, Brightness (Typical): 250 cd/m²", "Refresh Rate: 60 Hz, Response Time: 5 ms", "Viewing Angle: 178 degree horizontal 178 degree vertical", "Flicker Free Technology: Yes, Low Blue Light Technology: Yes"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71iyrFUktHL._SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/71iyrFUktHL._SL1500_.jpg", "path": "full/3abd3a6809fa24dae8982f3d46df86a405a2fccc.jpg", "checksum": "fd4b3fe7bf08cf495279cf12cd9c047b"}]},
{"title": "LG 27MK400H-B.ATR 27-inch Full HD Wide Angle Monitor (Black)", "brand": "LG", "rating": "3.9 out of 5 stars", "price": "₹ 12,499.00", "colour": "not defined", "instock": true, "reviews": ["I bought LG over samsung, HP and others just because of quality. but to my surprise the quality of this product is not great at all, seams like someone just sent me outer-box of LG with logo and inside some D grade Chinese product.", "#LGCRAP #worstproduct #nobuy #LG", "No problem with picture quality but there are many better quality panels available so i have 3 * otherwise in this budget, the quality is too good.", "Likes: Picture Quality, Value for Money, Overall Built Quality.", "Dislike: Side Angle", "Value for money", "Build quality is good, I got this on offer, in a budget this is best monitor for gamers...do 100% color setting in pannel you will get awesome quality of pictures..."], "description": ["27-inch full HD monitor", "170 x 160 wide viewing angle", "HDMI connectivity, vga port", "AMD free sync", "2ms response time", "Dynamic action sync", "Black stabilizer", "Onscreen control", "Wall mount", "Game, photo, cinema, custom, reader mode"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61LQvVkLXEL._SL1179_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/61LQvVkLXEL._SL1179_.jpg", "path": "full/b668c995087310997610dec57f6e4b60ec7bb6ad.jpg", "checksum": "19374ae016febc820ca0a50e39a3b721"}]},
{"title": "Acer Aopen 19.5-inch (49.53 cm) LED Monitor with VGA and HDMI Port - 20CH1Q (Black)", "brand": "Acer", "rating": "3.8 out of 5 stars", "price": "₹ 4,310.00", "colour": "not defined", "instock": true, "reviews": ["Product discription is missleading. Its not a LED monitor. clear a cheap quality LCD. piture quality is too poor. Veiwing angle is not good as its cheap LCD. Seller / Amazon kept the item discription smartly to misslead the customers. They make the policy hard to contact them. Unable to detacjlt HDMI port. Not able to use as extended display.", "Instead of take a quick action they inveatigate the issue they are misleading the customer. Should mention clear product discrpition. product is not worth more the  2k, years back technology. smartly kept mrp and give discount to people. After they make the policy such that you have to take hell lot to contact them and return for refund. This is totally misleading the indian consumers who may not know much about the product technical details.", "Nice product. Came on time. Very easy to install. A power adapter is no longer necessary, it is direct connection with an AC power cord.  The only issue is, the seller's description said it is a LED monitor, but, the product and the product booklet says it is a LCD monitor. The technical difference hardly matters to me, but, the product description and the actuality should have matched.", "This is a LCD monitor and not a LED monitor as mentioned on the product page as well as on the box. On the product it is specified as LCD and the viewing angles confirm that. It is good only if you see the screen head on (same level as the monitor and directly from front). Not good enough of kept at a height.", "Best product Bought in Amazon", "Superb Picture Quality in 5000", "Thanks to Asus and Amazon", "Bought this monitor for a decade old Pentium PC. Price is good for 18.5 inch branded monitor. Picture quality is good enough, no issue of dead pixel and it is LED (not LCD as written in some of the reviews). This is not meant for gaming or even for software development; considering larger, faster and vivid monitors available now-a-days. But this will get your job done for occasional mail check, social networking and office work. Could also be used for your IoT or DIY job where you need a secondary monitor or a display for your Raspberry Pi etc.", "Please do not order this product as it is an LCD not an LED. I had a talk with the customer service team also and they asked me to return this product. This review I am putting just to make you aware that DO Not Buy this product as the description is misleading.", "I just needed a LED monitor to replace the old CRT monitor that is occupying lot of space. This computer is only used for preparing word documents for official purposes. So I was not keen of buying a high quality monitor at an expensive price. This model suit my needs. It is also branded. During a sale I got this for Rs 3500. It is not a IPS monitor. So viewing angles are not great. Only the person sitting opposite can view properly. The color rendering is not bad and not great. Overall buy it only to use as a desktop monitor for day to day works. To watch movies or gaming choose some other LG model at a higher price.", "Worst monitor that I have seen in my life and when I say this I mean I have used non branded chinese monitors, cheap monitors from Indian brands such as Zebronics, Intex, Micromax, etc..", "Viewing angles are so bad that I had to sit infront in center of the monitor to get any work done, I wasnt able to see anything from sides or it was blurred if I moved to the sides, I wasnt able to see anything atall from the top.", "Built quality it so bad if you sqeez the bottom plastic bezel ripples are seen on whole screen. Also monitor is so light weight and imbalanced that even a little touch can make the monitor tumble and fall.", "Overall very bad experience with Aopen. If you are planing to go for a cheap monitor save your money and go for Zebronics or even Dell.", "Also Amazon has only replacement policy for monitors you cannot return this monitor for a refund."], "description": ["LED monitor with HD 1366 X768 Resolution", "HDMI & VGA ports with VGA cable inbox", "200 nits brightness - 5 MS response time", "1366x768 at 60Hz", "VESA wall mount ready", "The flicker screen is less visible, but makes eyestrain, even damage eye health, especially for those heavy monitor users, like programmers, writers, students or graphic designers"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/81W83eU6jSL._SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/81W83eU6jSL._SL1500_.jpg", "path": "full/33da4b36e2edb4af0450d02032a5fa3381a3e288.jpg", "checksum": "3dd5efacba6de15bd079869fac05e359"}]},
{"title": "HP EliteDisplay 23.8-inch (60.45 cm) IPS Anti Glare Full HD Monitor with Pivot Rotation and VGA - E243 (Black)", "brand": "HP", "rating": "4.5 out of 5 stars", "price": "₹ 13,499.00", "colour": "not defined", "instock": true, "reviews": ["Although I got this monitor very quickly within 3-4 days of my order.", "Everything is good except when it has black background or dark picture on the screen the light bleed is noticeable very clearly. Im a visual effects artist / graphics designer so this is so not acceptable for this kind of defect.", "Always check on the black background video or picture to see if monitor has this light bleeding defect.", "I bought this monitor for a multi monitor setup with my previously purchased Benq Zowie 24\"(HD). I wanted to use it for my graphic designing and 3D work.The reasons for which why I like this monitor", "Pros", "- Trustworthy brand HP", "- 27 inch", "- Lightweight", "- Thin and Sleek Design", "- Silver and black color combination makes it look elegant.", "- The images are fine and crispy so far.(No Pixelation)", "- Very less border area.", "- It comes with an AC adapter to prevent the product from any electricity based damage which is an advantage over others.", "- Price worthy.", "-The design of the monitor stand is also unique in HP series and from other monitor manufacturers. The hollow space in between gives a completely different appeal.", "Cons", "- Very few color mode settings in the menu.", "- This monitor cannot be mounted on the wall or an arm using VESA mount. However there is one company which manufactures attachable part for this monitor which acts like a vesa mount and could be used to attach to an arm or wall", "There are not much cons so far and will come to know as I will get more familiar to this.", "Although Benq, Asus, Samsung and Dell also had 27\" Monitors , some were cheaper and some were expensive but I bought this because of its unique design, picture quality and the reviews on amazon, youtube and other sites.", "I hope it helps. :)", "The display is nice. Good viewing angles as expected from an IPS monitor. The monitor is very sturdy. The stand is metallic, very heavy. You get 3 wires with this monitor (VGA, DP and USB type A) but no Hdmi. Please note that there is no hdmi cable with this product. In fact when I use hdmi with my laptop HP ab031tx, it does not show any display settings. This pro is converted into con. In some laptops hdmi cable and HP display assistant does not run, meaning you cannot change the orientation to portrait in certain laptops like my HP ab031tx, further you cannot change the brightness and other settings on-screen (though you can change that through buttons on monitor). I talked to HP executives they told me there is fault in my laptop. In fact there is no fault in my laptop it is just that some lower hardware laptop (less than nvidia 950m) (my laptop has 940m and Intel 5500 graphics) cannot run HP display support assistant, and there is no solution for it. HP support is not good when it comes to monitors though it is good for laptops and printers.", "My brother's desktop has same nvidia 960 and display settings run without DCI error.", "Conclusion", "Display is good and sturdy. With height increase- decrease facility. It runs on my laptop smoothly though my laptop is not able to access its full power like access on-screen settings, change orientation etc. Otherwise, display is good. I will recommend it for reading and watching movies though not for gaming as response time is 5ms.", "I had Purchased 27\" monitor last year but now there is a problem(Vertical Line in the display ) in the screen, Now HP service told me that they required a bill with product serial number mention in it. I am requested to Amazon and appario retail private ltd, Please provide me the bill as per the Hp Services requirement.", "This display is very good. Actually my mac is in the other room n I wanted to work in another. So wanted a soln for it. This display with AnyCast solved my problem. I was comparing LG n this monitor. HP has n advantage of tilt rotate etc. it has USB port so I got power for my anyCast also. Quality is very good n I got an awesome deal here. Amazon rocks ! Only one thing is missing that are the speakers. So 4 star else I would have given 5 star. If anybody is planning to buy a monitor I would suggest that just go for it.", "The monitor is really great in terms of resolution and thickness.", "But it would have been better if it had a horizontal tilt mechanism. Today the joints are slightly shakey.", "Over all it servers the purpose.", "Overall it is good monitor for everything. For the first time when turn on the monitor I noticed the backlight bleeding (left and right). If you watch movies or play games, it is not a big issue. But if you a artist related to specific color, this is not for you. I'm a graphic designer, I can't find pure blacks on this monitor. Some kind of teel color is there. I went to all the settings, but I can't find the right one. But it is good monitor for entertainment. Watching movies is a different experience in this monitor. A rich feel is there while watching movies.", "The display is undoubtedly nice. It has swivel feature which allows you rotate it to a full 360 degrees. I always wanted a vertical display (really helps in coding!) and this fits the bill nicely. It is just a normal display with a 21.5\" screen (with a rotate function - missing in most other). But the description video on Amazon and the HP website paints a different picture altogether. Features like pop-up camera for skype call and Bang and Olufsen speakers are not there. The monitors of this size can be easily bought for under 10k, so you can say you are paying 5000 bucks extra just for rotating it to 90 degree angle. Doesn't make any sense at all."], "description": ["Expand your productivity with uninterrupted views on a high resolution, 3-sided micro-edge bezel IPS screen that supports virtually seamless multi-display arrays", "Find your most comfortable, productive position with adjustable tilt, height, swiveland up to 150 mm height adjustment settings", "Connect to your most frequently-used displays and devices with a range of integrated ports right at the display", "Easy USB peripheral connectivity from the built-in USB hub and VGA and DVI inputs", "250 cd/m² Brightness and 1000:1 static; 10000000:1 dynamic Contrast", "1 VGA, 1 HDMI 1.4 (with HDCP support), 1 DisplayPort 1.2 (with HDCP support), 2 USB 3.0", "Tilt: -5 to +23 degree; Swivel: 45 degree; Pivot rotation: 90 degree; Height: 150 mm", "Energy Star certified, EPEAT registered; Arsenic-free; Mercury-free; Low halogen"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/81ESAee6o9L._SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/81ESAee6o9L._SL1500_.jpg", "path": "full/b08c0db641db6b4ae357854ba938fcf06bbb994a.jpg", "checksum": "987282b8a6f2538d15fefe1ae42cd77e"}]},
{"title": "VIEWO 15.4 inch VPRO1 LED Backlit Computer Monitor - Full HD with VGA, HDMI Ports - ZEB-A16FHD LED", "brand": "viewo", "rating": "3.1 out of 5 stars", "price": "₹ 2,349.00", "colour": "not defined", "instock": true, "reviews": ["Very gd products low price", "Not durable and bad material quality", "GOOD PRODUCT n VALUE FOR MONEY..", "Unsatisfactory product in this Price(2349/-), this should be cost around 700/-, the display is very bad and it not upto the mark", "First time it came, one of the buttons was not working.. Replacement done in 4 days.. The next one that came, worked perfectly for 2 days and after that suddenly, the screen went white completely.. No video, nothing.. Just a white screen..", "Returned it and waiting for refund..", "Inferior product.. No quality checks I guess..", "Also, the viewing angles are also very limited..", "Product broken for the second time need immediate replacement", "This is value for money but is not LED panel it is a LCD panel but this price range it is amazing but brightness is not controllable but  low brightness it's amazing picture quality it's full HD and built in HDMI port and VGA also......", "I recieved this product within 24 hours. And I was very strange when I open the pack of the product that was defective. I request to replaced the product. I again was very strange that I recieved also another defective product. I immeadiately called the delevery boy, but he didnot recieved my call. So I suggest not to buy this product. I request to refund money to my bank a/c."], "description": ["Screen Size: 15.6 inch (39.6 cm) Full HD (1920 X 1080) Panel. The power consumption is 10 watts", "Connectivity Port: 1 VGA Port, 1 HDMI Port", "Aspect Ratio: 16:9, Brightness (Typical): 220 cd/m²"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/717iy766sYL._SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/717iy766sYL._SL1500_.jpg", "path": "full/7fb995d948304200078ac311ab939ba2cfbbc69b.jpg", "checksum": "7767ad6cb6c43b62e56e2683a074c32a"}]},
{"title": "LG 24 inch Gaming Monitor - 1ms, 75Hz,Full HD, IPS Panel with VGA, HDMI, Display Port, Heaphone Ports - 24MP59G (Black)", "brand": "LG", "rating": "4.1 out of 5 stars", "price": "₹ 9,647.00", "colour": "not defined", "instock": true, "reviews": ["Although i did plenty research on every aspect before purchase, but eventually have mixed feelings.", "Pros :", "-- Very beautiful sleek design! (As good as Predator series, a major reason why i chose this! And it takes very less space compared to those old roundish bottom flat monitors ehe... its looks are a killer! :) )", "-- Anti Reflective Matt Coating is effective.", "-- IPS Panel, so wonderful wide viewing angle. Truly 178 degree horizontal and vertical, many people can see.", "-- Important Connections : Display Port 1.2, HDMI 1.4 , Audio Out Jax (good thing they didnt waste money on waste speakers like rest), so you can make it a TV with added speakers using HDMI and Audio Jack.", "-- Actual response time is 5ms, which is decent for an IPS panel.", "-- FREE SYNC! Trust me, MUCH better than Vsync of even best GTX1080ti! (only Gsync could match it), Say good bye to screen tearing. And hopefully AMD FREE SYNC will get NVIDIA off their high horses huh... I aint AMD fanboy, but we really wish fair competition instead of Evil Monopoly!", "-- And hey, brightness was surprising all right! i thought this 250 nits will be much lesser than 300 Nits i was used to on laptop and old LG19inch but 250 nits is well spread, screen bleeding is minimal)", "-- A lot of Controls! Yeup, i like being able to totally customize every aspect, and this monitor gives you A Lot of options! (even 2 3 4 screens on same! Although the control button is like Old Nokia mobile 4 way stick, but so far so good...)", "-- And it does work at 75hz! (unlike what other ppl claim thats only FreeSync feature for AMD), i used on GTX1050ti OC.", "-- Balanced pricing for features it offers.", "Cons:", "-- ALAS! The Color Accuracy, contrast is NOT As good as i imagined... duh, my biggest and only disappointment i guess, my old LG19 Inch Flatron has better color! huh, i wasnt hoping this from IPS panel which boasts 72% on Adobe, and same on Color Gamut... Its not bad but just not great, so lets hope, i can get some color calibration so that it becomes as good as it boasts!", "-- Lack of Tilting or Twisting", "-- No VESA support or Height Adjustment (atleast VESA MUST be there, then you can mount on stand and adjust), i took this as known compromise, still if you have worked on height adjustment, you will miss it.", "-- AND REMEMBER! If you go to 1080p from 720 or even 900p, then you MUST have stronger CPU and GPU! Or else, screen Tearing etc will be unbearable!", "-- And 1ms Motion Blurr is arrant nonsense! Trust me, you are much better without it!", "And other things like Power Consumption etc are normal for IPS Monitors at this price range.", "And btw, i got from Appario, the product was nicely double packed! (yep, double pack). With warranty card and bill. Clean new piece.", "So i wrote what i could remember, a bag of mixed feelings.. but overall, 4/5, and i am staying with it..", "EDIT: I had to edit the review and give it 1 star instead. The one star I took is for terrible service from LG. My monitor has a white spot from inside the monitor screen, LG refuses to honour their warranty. So I contacted Amazon and even they refuse to return the product now as it is out of return date. I feel like I wasted my Rs.12,000 on this damaged product.", "I attached a picture of the issue, monitor has a big white spot from inside yet LG refuses to fix it.", "My old samsung had a blue line issue and they replaced my monitor in a week - no questions asked. So this 3 year warranty of LG is useless, beware. I suggest you to avoid this product and look for a Samsung monitor instead.", "Original Review:", "Quite the average monitor but a little overpriced for what it actually delivers. Sad part is that it is so overrated here in other reviews which is making more people fall into buying this monitor.", "First of all let me warn you that the seller Appario Retail Private Ltd is sending used products. I received a monitor with damaged display first, then I asked for a replacement and received one with scratches. Looking at seller reviews many other people have said the same that they received used products so I reported to Amazon but no action was taken but I'll ask you to avoid that seller.", "Now I'm stuck with a monitor with scratches even on the front of the display but I'll review the monitor ignoring these issues.", "• The quality of the monitor is pretty average. The display gets too sharp on few colours which makes you see the pixels on screen with light colours such as the blue of twitter. Every time there is blue colour on screen you can see horizontal and vertical lines all over them (pixels) which can be quite annoying most of the time. Surprised that not many people have talked about this in their reviews, googling shows that this is not my piece of the monitor but but every version of it with the same issue.", "• All the \"gaming\" features are just gimmicks. 75hz, 1ms response rate and other stuff just doesn't work as intended. The monitor really is running at only 60hz most of the time while gaming if you're using DSR. 75hz works on 1080p and 1ms response rate mode flashes the screen badly making it completely useless. I have a nvidia card so couldn't check freesync but I doubt it's quality would be up to the mark either.", "• The only good thing I can say about this monitor is the design. The top portion is very slim, the stand looks good so in terms of looks, monitor feels good. Apart from that, I don't really see any positives about it.", "• Monitor also faces the issue of ghosting on 2D scenarios. In 3D it works fine but in 2D there's ghosting whether it's 2D games or a 2D animated video that you're watching.", "• I tried to register the product with LG but their website doesn't work properly either. I contacted their support for help and haven't heard back in 2 weeks. I can only imagine how bad their service center would be in case this monitor needs repairing.", "Final conclusion: I'm very disappointed with this monitor not only because I received a used product but also because the quality of the monitor is average at best. LG service is terrible and I wish I went from something from Samsung instead. My old Samsung monitor has been going on for 9 years now and it required repair once long ago during which time Samsung's service was excellent and they repaired my monitor within days.", "I'd advice you to avoid this monitor and look for alternatives.", "Like", "Bad:", "Background bleed on the bottom left side of the panel otherwise good ips panel,", "The on screen controls are not working for me for a month now it worked in the start", "Really bad stand shakes when you move mouse or type hard in keyboard", "1 ms is a gimmick it will tear your eyes", "Good:", "Good 75hz monitor nice for CSGO etc.", "Value for money is pretty good.", "Thin bezels feelsgoodmam", "Ips Panel,viewing angle are great", "Is a very good quality monitor for Indian gaming community. Pictures quality is excellent. Best refresh rate. Gaming look monitor . Thank u amazon for best price", "Best monitor for gaming within limited budget,i have been playing cs go dota and many modern warfare games since 6years and i have been changing monitors on and off but i bet that this is the best monitor in this range of budget", "The only DEMERIT of this monitor is that it shakes a bit when you do a drag with your mouse as an awper i feel this is the only thing that needs to be rectified.", "Very good picture quality. Very bright display. Has a Backlight Bleeding on the bottom left corner.  Yet to decide whether to replace it or keep it.", "The box was very slightly damaged. No damage to internal thermocol or product. Very good stand.", "2019-10-04: My replacement came and has si better than my previous one. I do have a slight backlight bleeding on my right side but better than my previous one.  I will keep it.", "2019-10-12: Found a dead/stuck pixel in the second monitor too."], "description": ["Screen Size: 24 inch (60.45 cm) Full HD (1920 X 1080) Gaming 1ms Response Time IPS Panel", "Connectivity Port: 1 VGA Port, 1 HDMI Port, 1 Display Port, 1 Audio-Out Port, 1 Headphone Port", "Aspect Ratio: 16:9, Brightness (Typical): 250 cd/m² ; Color Depth (Number of Colors): 6bit+A-FRC, 16.7M colors ; Surface Treatment: Anti-Glare 3H", "Refresh Rate: 75 Hz, Response Time: 1 ms, Input: 100~240Vac, 50/60Hz, Normal On (EPA): 17.1W, Surface Treatment: Anti-Glare 3H", "Viewing Angle: 178 degree horizontal 178 degree vertical", "Flicker Free Technology: Yes"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/81CsCZMo2DL._SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/81CsCZMo2DL._SL1500_.jpg", "path": "full/ecb7f7d4f7ef03165ad71f1fdf7d3be5d3eb9dad.jpg", "checksum": "2c537e45eecc203f2087736f10315497"}]},
{"title": "Acer Nitro QG221Q 21.5 Inch Full HD Gaming Monitor - VA Panel - 1 MS - 75 Hz - 250 Nits - AMD Free Sync - 1 X VGA 2 X HDMI", "brand": "Acer", "rating": "4.4 out of 5 stars", "price": "₹ 8,299.00", "colour": "not defined", "instock": true, "reviews": ["Out of the Box colors are not good..I had to manually set the colors with Nvidia panel...VRB set to extreme loses lots of colour details its set to normal for best...75hz refresh rate is good....Blacks are deep not grayish. ..I have nvidia gpu so no freesynce ......Display is finger print magnet.....", "Cons...The monitor buttons are hard to use it is recommended to download display widget software from Acer site....VRB lose brightness and colours..there is ghostig too.", "New..I changed the rating to 5 star from 4 star.This mobitor is really...Unlile anyother I see.No backlight bleed and No VA glow..deepest black you ever see.I actually order another one, will receive It at 28 aug..Then my build will be complete.", "Being a gamer...i needed a monitor and this came in..i took it...so here is a small review. The monitor is nice. Its good lookinh the picture quality is good (note: purchase it if are going to game all day long. Don't buy it if you are going to watch movies and all) The refresh rate is good. Its written 21.5 inch its 22inch.", "Pros :", "VA Pannel quality is really good.", "Not soo much blackbleeding.", "Good Refresh rate.", "Hardy Built.", "Good amount of ports.", "Anti-glare coating is perfect.", "Cons:", "Viewing angles are sometimes terrible. (But still great for a VA pannel)", "A WEBCAM can be provided.", "At last of are going to buy this for gaming go for it..and if you are buying this for watching movies and all dont go for an IPS monitor.", "Excellent gaming monitor. Came with a VGA and HDMI cable. Running great with 75hz refresh rate. Very crisp and rich display, looks amazing while playing games!", "Gaming:-", "Buy this monitor for gaming if you don't care about your eyes. To achieve 1ms (measured 1.7ms MPRT though it isn't mentioned in specification whether it is GTG or MPRT) response time it uses VRB. Which is a new technique to reduce response time by strobing back-light and that makes eye strain.", "Other than Gaming:-", "It has a response time of 12.7ms without VRB. And watching movie also a horrible experience. YouTube, NetFlix and Watching movie isn't recommended according to my experience.", "Real Bad thing:-", "What I was not expected from this price point of VA panel Monitor is \"Color banding problem\". It happens to lower color bit depth of monitor and in specification nothing mention about bit depth or color bit. At windows display settings it shows 8-bit but appears like 6-bit. By ignoring this problem color performance is very good, exceptional color performance for VA panel.", "Good thing:-", "The Black Level which is very Impressive. No back-light bleeding of panel glowing like IPS panel. Black are real rich black. I watched some HDR sample from YouTube which was amazing. Color is really good and should not have any major issue with professional work.", "I bought this for the black level. I tried off of IPS glow and Gray Black.", " Initially I thought that 8k rupees is not at all cheap for a 75hz gaming monitor and I was having a feel that this monitor is as good quality as it is expensive. The specs and Amazon reviews fooled me into buying it. It is probably the worst 'gaming' monitor and suffers lots of problems:", "1) The biggest and most irritating/irresistible problem: it has very very high amount of ghosting.", "I have literally fiddled with all monitor and GPU settings and have done extensive research on internet about it but still it ghost like crazy as you can see in pic. I have tried resetting monitor settings to default, enable/disable vrb, overdrive. Adjusting hue/saturation. Nothing fix the insane amount of ghosting it got. Then I thought my gpu is at fault but I connected my pc to brother's monitor and no ghosting. It becomes worse when you actually play a game. Graphic intensive games like metro exodus shows ghosting affect in entire atmosphere. Textures/edges becomes blurry and black when you move the camera in game, watch the above vid(note: it's not a glitch in game it's actual real ghosting which becomes much visible in darker background, see UFO test pic). Even CRT monitor don't get the amount of ghosting that it has.", "2) It's lower Freesync range is only 48hz: For example if you set monitor refresh rate to 60hz then freesync range is 48hz-60hz, if you set monitor refresh rate to 75hz then its range is 48hz-75hz. This is a big problem if a game has fps drops below 48fps then freesync will stop and you get massive stuttering. Also I have find a freesync bug that when your fps drops below the lower range(here 48hz) your screen will give you brightness flicker. And wow.. they haven't specified to us such important factor in details.", "3) it's response time is very bad: the 1 ms stupid vrb feature (a complete lie) that kills your eyes is not even upto its marks. As I told in point 1 that I get extreme amount of ghosting even when vrb enabled. It means it has very bad real response time(monitor ghosting is literally a high response time problem) I don't even know what could its real response time is maybe around 15-17ms.", "4) 1ms vrb is broken and is not 1 ms at all: vrb is an unfair tactic of Acer to mask its low monitor response time. It is  a LCD + VA panel monitor so it will never achive response time as low as 1-5 ms(by theory) that gaming monitors should have. 1 ms vrb is nothing but a fast rendering transparent grey image inserted at back of display at speed equal to monitor refresh rate. It gives the effect of fast visual response by eliminating (or should I say masking?) the motion blur produced by moving images. You can verify it by looking your screen with your phone camera when vrb is enabled. Sadly vrb being just an ugly masking effect does not decrease the monitor's real response time thus ghosting is not eliminated at all.", "5) it does has some backlight bleeding and it will only become worse with time: pictures look crap because of backlight bleeding.", "I do not recommend this monitor. Maybe I just got a bad unit but according to my research these are not defects in monitor, it's just how this monitor is designed and works. Please guys don't get into these fake promises that company claims. Also do extensive research before putting money into any electronic.", "A very good monitor for the price with a refresh rate of 75hz, supports freesync and 1ms response time.", "Includes power cord, HDMI cable and VGA cable. good packaging. Does not have speakers...", "Great for the price, the viewing angles are pretty good considering it's a VA panel. Colours out of the box are pretty horrible but after doing some colour calibration and setting the gamma to 2.4, the screen looks pretty great. Just increase the saturation for all colours by 10, and set the gamma to 2.4", "Love it connected to my laptop this was worth the purchase", "It's generally 75hz", "Can be overclocked to 76hz nothing more", "1ms response time", "1080p vn display", "Colours not bad", "Shipped proper and came the next day even doe it said it would take 3 days I'm happy 😊", "Very fine bezel", "Can be mounted on a vesa arm."], "description": ["21.5\" VA Panel with Full HD 1920 X 1080 Resolution", "1 MS Response Time - 75 Hz Refresh Rate", "1 VGA 2 HDMI Ports with Inbox VGA & HDMI Cables", "AMD Radeon Free Sync Technology", "VESA Wall Mount - Black Boost Technology - Flicker Less Technology", "3 Years On Site Warranty"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61p1tcPeU4L._SL1019_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/61p1tcPeU4L._SL1019_.jpg", "path": "full/5e506fda9941546f1014afaf4d556cd76f478929.jpg", "checksum": "8622116bc50f41cf732c6e6f7111e334"}]},
{"title": "AOC 24B1XHS 23.8\" LED Monitor withHDMI/VGA Port, Full HD, Wall Mountable, 3 Side Borderless", "brand": "AOC", "rating": "3.9 out of 5 stars", "price": "₹ 7,400.00", "colour": "not defined", "instock": false, "reviews": ["Undoubtedly recommended.", "Excellent packaging from amazon.", "got with promised delivery within two days @INR 11489.", "Good that in box accessories include both VGA and HDMI cable.", "Top three side bezel less. Picture quality is eye pleasant(have to tweak some settings).", "I already have another AOC 20'' monitor but wanted to upgrade to 24'' so was looking for options & was almost finalized Dell 24'' but due to it's higher cost(approx 19.5k) than my budget, I finally decided to go for this.", "Honestly speaking i don't find any noticeable difference between Dell and this except more ports and height adjustment options  in Dell.", "24'' monitor is really more than sufficient for almost all kind of need.", "I am once again satisfied with the AOC brand, earlier one that i was using is 7 year old and i had never faced even a single problem.", "This monitor was delivered to me on Sep 12 2019. I was very excited about this monitor it came with near bezel less design and is a 1080p resolution. I was shocked by how it turned out. The IPS bleed is horrible. It is visible on all corners. Even if you decide to ignore them, there is even more crazier issues. There is no fluedity in videos, even if you are watching 1080p video at 60fps,  there is visibke stuttering.  Cant even watch hdr content online. Terrible for gaming as well due to stuttering.", "Picture quality is not dynamic. The even though you play video at 1080p, the movement of objects in the videos are not fluent. The flow of video is not smooth what i mean. I compared the quality of display by playing same video in my laptop and the screen and found my low resolution laptop screen doing a better job.", "Bottom line : Chinese is always Chinese", "I'm returning my monitor and going to buy HP or LG or other well known brands", "Each and every details can be seen on this moniter", "Great quality.Colors are true and unlike Dell monitors,AOC displays are cool,eye irritation free. I spend atleast 10 hours a day infront of it.", "Cons: It doesnt have speakers", "I bought this monitor based on several variety of models using in my company. So finally I decided to go with this. After few months of review the pixels are fantastic. Product was delivered on time without any damage. Package was good. I am using gaming PC and this one suits well for gaming and movies.", "Love the size of the screen, the bezelless frame and sharp quality picture 👍.. it arrived safe and sound without any damage, thankyou seller.", "Good picture quality you will love it strongly recommend 👍"], "description": ["AOC 24B1XH resolution : 1920x1080, refresh rate : 60Hz,IPS", "3 year AOC India warranty", "1920x1080 resolution", "Flicker free backlight technology", "Response time 7 ms", "Full HD monitor"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61NX30Rh26L._SL1000_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/61NX30Rh26L._SL1000_.jpg", "path": "full/52e153dd3d38488b15920f938f23305d15c82bba.jpg", "checksum": "b0433a4da72d875fbf46b80fea3033e5"}]},
{"title": "Dell 23.8 inch (60.47 cm) LED Backlit Computer Monitor - Full HD, IPS Panel with VGA, HDMI Ports - E2418HN (Black)", "brand": "Dell", "rating": "4.2 out of 5 stars", "price": "₹ 9,078.00", "colour": "not defined", "instock": true, "reviews": ["First to review.  😂😂 Not to worry, its authentic.", "I've been using Dell LCD monitors with LED backlight displays for quite a reasonable period. I've always been impressed by their build quality, reliabilitiy and service response. Though there are other manufacturers offering more peripheral features to blind the eye, I suggest this monitor for an average user. Extremely suitable for home use, movies, office and such applications of continuous as well as intermittent frequencies. Game freaks might be a bit pissed off, but still this doesn't disappoint much. The pixel size is just right. All you need to approve is the 24\" size, which according to me is okay since I'm upgrading from 22\". For others, see to that.", "Packaging was good. Had a power cable as well as an HDMI cable. All you need is plug and play.", "I got this for about 7600. Delivered in about 3 days.", "For the price it is certainly a steal.", "I have 2 Ultrasharp monitors and got this for someone else (U2415 & U2414H). If money is not an issue then I'd recommend the 16:10 - 1920x1200 Ultrasharp Dell Monitor over this anyday.", "Compared to the Ultrasharp,", "1. The sharpness is certainly lower. If you are a normal user you may not even notice it.", "2. The blacks are slightly grey. White does not have a yellowish tinge.", "3. Colors are pretty good.", "So if you are the average user or on a budget, then you should be good with this. It is certainly a steal at the price. I doubt I could get better for the price.", "Hope it lasts at least 5 years.", "Good Product @ ₹10889 for Dell E2418HN. The monitor is best at this price. It came with Power cable and HDMI cable but no VGA cable was included in package so website page needs some rectification. I am using this awesome monitor through HDMI and it is working superfine.", "Pros:", "Big 24 inch display.", "Good quality screen with Full HD.", "Great viewing angles.", "Best for daily work and watching movies.", "Cons:", "Screen refresh rate is little low which is good for playing games but not the best for high end gamers. Can't complain much or expect higher refresh rate at this price.", "Thus i recommend it to those who are willing to buy big display at affordable cost.", "Cheapest 24 inch monitor in this price range", "Quality of picture is poor, however its ok for normal usage", "Don't go with it if you are planning to have graphics work with it", "+ Simplicity", "+ Trusted brand", "+ Build Quality", "+ Worth the price", "+ Included HDMI cable", "+ If you're lucky, you might get an extra power cord ;)", "- Slightly thick bezels, but can't ask for more at this price point", "- Slight IPS bleeding at edges, but only noticeable in dim lighting", "The product was packed well and was delivered on the expected delivery date.", "All items included were good but one item, the power cable was missing in the package.", "Received package in open condition with absence of  power adapter which was mentioned in your accessories list apart from this every thing is perfect, you guys can find out this on the snap which I paste on your photograph section, pls post me the authorized power adapter.", "I really like it.", "Value for money."], "description": ["Screen Size: 23.8 inch (60.47 cm) Full HD (1920 X 1080) IPS Panel", "Connectivity Port: 1 VGA Port, 1 HDMI Port", "Aspect Ratio: 16:9, Brightness (Typical): 250 cd/m²", "Refresh Rate: 60 Hz, Response Time: 5 ms", "Viewing Angle: 178 degree horizontal 178 degree vertical", "Flicker Free Technology: Yes, Low Blue Light Technology: Yes"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71chznjvcXL._SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/71chznjvcXL._SL1500_.jpg", "path": "full/4971acdadf267498b2ee6ce77bdc298dd7d14668.jpg", "checksum": "8f42392aa783fc6d26ee91538c5b333d"}]},
{"title": "BenQ GW2470HL 23.8-inch (60.45 cm) Thin Bezel LED Backlit Monitor-Full HD, VA Panel with VGA, Dual HDMI, Heaphone Ports, Eye Care Technology - M353497 (Black)", "brand": "BenQ", "rating": "4.2 out of 5 stars", "price": "₹ 7,599.00", "colour": "not defined", "instock": true, "reviews": ["Very nice product i really appreciate the product,worth buy it.the resolution is 1920*1080.2 HDMI ports for attaching monitor.And low light feature is too good for eyes. worth buying it.", "Loved it.... awesome....my old vl2040 benq got some panel lines so I chose benq once again.... that too at 7800 rupees I got 24 inch full hd VA panel.. got 3 types of input connector VGA, DVI , HDMI and with speakers and audio line in also.... viewing angles are too fine....played games like sniper elite 4 and visual quality was too rich....for those who  says HDMI not detected should read the manual or see you tube...you should select HDMI auto detection in monitor menu. Not expecting more...got more than expected. Got irritated by local delivery guy. not delivered as they committed (12-1pm) one time and delayed delivery till 2.55pm....had to wait for them without doing other work in that time...Enjoying watching movies", "The product image quality look good. I am upgrading my 2008 Benq monitor. It serves the purpose . It has 2 hdmi output , one vga and one audio out. It has automatic hdmi port detecting but you have to turn it on in settings. I am connected it with ps3 and a TV box . The video looks good. No problems detected as of now. I will update if something happens. Hope this help", "Purchased for 7600 !! Thanks Amazon. Great monitor. Don't be confused about VA vs IPS. It uses AVA panel which produced great vibrant colors with adantage of great contrast and price over IPS. Factory color calibration are basic , You must calibrate its colors before blaming it.", "clear black, good colour reproduction, easy switching between HDMI connectors,", "cable delivered not indian style, but fits well in spike guard", "happy, satisfied", "i received damaged product then i had to get it exchange...even after exchanging i received a defective product...hdmi port was not working it was showing no cables connected!! Not trustworthy!!", "If you plan to buy this for multi screen then I don't recommend this. (display color is not consistent. brought it for dual setup but  I could see different color.", "+ Black levels are lovely since this is a VA panel", "+ Because of great black levels, you can expect really good contrast ratio out of this, which really helps the colors pop.", "+ No backlight bleed at all which is a plus. Most budget monitors suffer from backlight bleed, but VA panels don't show this problem.", "+ The colors are really nice considering the price. Not a match for IPS LCD, but the colors are good paired with high contrast makes for a great viewing experience, especially for games which have a lot of dark scenes.", "+ Gaming is reasonably good. VA panels are not particularly known for their response times, but if you are a casual gamer, then you won't notice any difference compared to other panels in this price range.", "All in all, a great buy and easily worth the money I paid for it. Great buy for under 9k. Go for it."], "description": ["Screen Size: 23.8 inch (60.4 cm) Full HD (1920 X 1080) Thin Bezel VA Panel", "Connectivity Port: 1 VGA Port, 2 HDMI Ports, 1 Headphone Port", "Aspect Ratio: 16:9, Brightness (Typical): 250 cd/m²", "Refresh Rate: 60 Hz, Response Time: 4 ms", "Viewing Angle: 178 degree horizontal 178 degree vertical", "Flicker Free Technology: Yes, Low Blue Light Technology: Yes"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/81GSxVoEWHL._SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/81GSxVoEWHL._SL1500_.jpg", "path": "full/729361f43fd675bef6a3fe6e3ffaed74a06de7a1.jpg", "checksum": "65acb67da19caf1795ac3b42711854d3"}]},
{"title": "Acer 31.5-inch (80.01 cm) Curved Full HD LED Backlit Computer Monitor with Stereo Speakers - ED322Q (White)", "brand": "Acer", "rating": "4.0 out of 5 stars", "price": "₹ 16,499.00", "colour": "not defined", "instock": true, "reviews": ["So i wanted a display just for my ps4 , i was considering a tv to buy, later on i went with this moniter and i was blown away by the immersive picture quality by it it has really good curve and give u the best gaming and movie watching experience, though the sterio speaker is not that great , but the display is awesome.", "Looks great, sleek design. Curve is great, just the right amount. Nothing this big(32 inches) for this price.", "Using it for programming and browsing mainly.", "for colors and audio, monitor is use less, only you can enjoy big screen, dont waste your bucks, better buy a good products with extra money, I am asking for replacement. amazon is trying to refund money. When it shipped with out display cable means, some used it rejected the peice. It was sent. Recently one of my frnd order this product. It was shipped with white hdmi cable. It for office purpose and we are using it. If the price is below 17000, I am going to buy again, I missed when the price dropped to 16399", "Excellent product with excellent packaging", "Superb picture quality", "This monitor with curve screen look beautiful, colours are good for gaming watching Full HD video, I have 2 gb graphics card so picture look more clear and accurate. Best curve monitor at this price range.", "Awesome.. I don't have any issue with this one.. I recommended. This is budget monitor for Editing and gaming", "Not good for 1080p resolution monitor. Text are cracky and very bad.", "Images, videos, pictures are super excellent. Good for HD video. Not text or programing as a monitor.", "Design is excellent.", "The in built speaker is so low, hardly audible.", "Really the best monitor 20ks can buy. I would definitely recommend buying this.The color tones are just perfect for daily computing. Deliver days could have been better."], "description": ["31.5\" Full HD (1920 x 1080) curved widescreen", "HDMI/VGA/DVI Ports", "4 MS response time/250 Nits Brightness", "Blue light filter/flicker less technology", "Zero frame design/audio out", "3W x2 Stereo speakers"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/A1OUm0nT0uL._SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/A1OUm0nT0uL._SL1500_.jpg", "path": "full/8cd66b4cd38038f4287e904c03ad8ffba93fce0c.jpg", "checksum": "6dda7c44c19a55fc03f8f765f83d6cd2"}]},
{"title": "LG 31.5 inch (80 cm) LED Monitor - Full HD, IPS Panel with VGA, HDMI Port x 2, USB Port, INBUILT Speaker - 32MN58HM", "brand": "LG", "rating": "4.4 out of 5 stars", "price": "₹ 14,318.00", "colour": "not defined", "instock": false, "reviews": ["Good Monitor....Big Size...Can use as a TV....But I feel too much big for a PC.... Anyway good deal to get a 32\" monitor in this prize range.", "Not recommended if you plan to use it as Desktop monitor. Piece delivered to me keeps resetting backlight to max. Resolution is not suitable considering the size of monitor. Sharpness is not that you would expect from a desktop monitor.", "Good monitor but display backlite bleeding problem  sound and aux was not good", "The built quality is very poor", "Too good in this price with inbuilt speakers, perfect for office use", "very good picture professionaly  can use", "Very Good Monitor", "A good product. Working fine.", "A good bargain for office use, browsing & movie watching. Please use HDMI Port instead of VGA - the output is better. I have been using this monitor extensively for a week. USB & Audio output port problematic., but use it as bare monitor for best results. Using monitor audio headphone port or monitor speakers produce some hissing noise."], "description": ["1080p Full HD resolution with IPS Panel. Resolution 1920 x 1080. Viewing Angle (H x V): 178° x 178° . Aspect Ratio 16:9.", "Connectivity - Input: USB*1, D-Sub*1, HDMI*2, Audio In, Headphone Out", "On Screen Control. Black Stabilizer. Refresh rate 60 Hz.OS Compatibility Windows 10, Wall Mount : 200x100", "The LG IPS Monitor ensures and awesome picture quality that provides clear images and vivid colors from any angle for your viewing pleasure. The Sleek Cut design, the remarkable reduction of depth with body frame, adds sophisticated ambience for your place.", "Warranty Information: 3 years warranty provided by the LG India from date of purchase"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/81ZsJsFwTaL._SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/81ZsJsFwTaL._SL1500_.jpg", "path": "full/2855e744410850c95bddbba8fc1baee16727734c.jpg", "checksum": "fb99f4db1cf943be885ba1787ff530d1"}]},
{"title": "BenQ GW2270H 21.5-inch (54 cm) Slim Bezel LED Monitor-Full HD, VA Panel with VGA, Dual HDMI Ports, Eye Care Technology, TCO Certified - M352983 (Black)", "brand": "BenQ", "rating": "4.4 out of 5 stars", "price": "₹ 6,899.00", "colour": "not defined", "instock": true, "reviews": ["Benq GW2270H is an awesome budget monitor.. got it for rs 7299 in the great indian sale..", "the monitor is good for everything, office work, gaming, movie watching, and what not..", "PROS", "VA Panels like this have aweome contrast ratio and does not have any backlight bleed like IPS monitors, so while watching movies, blacks will appear black and not greyish", "Great viewing angles, it wont seem like negatives as it happens when you see from sides in TN monitors", "Blue light filter helps while long working and gaming sessions :D", "2 hdmi and 1 vga port for connectivity, alongwith an aux cable port for audio which works only if you use an hdmi cable", "The monitor is VESA mountable", "CONS", "these aren't cons, just a few basic adjustments", "The monitor by default will recognise a vga input first and then it can be changed to hdmi in settings.. besides there's an option to enable auto switch between the hdmi and vga, so one can enable that :)", "Settings -- Input -- HDMI 1 or HDMI 2 port as chosen", "HDMI cable not provided, was hopeful that there would be one as new graphics cards hardly have a vga port these days, but I bought one..", "all in all its an awesome monitor.. love it.. a worthy upgrade..", "P.S. if you already have a 18.5 inch monitor, buy the 24 inch variant :D", "What an awesome monitor(GW2270HM) at a steal deal price,crisp and clear display , with all three ports vga ,HDMI,dvi. Speakers are not that loud but gets the job done for regular activities.", "Got it for only 7300 which is actually the price of the lower end GW2270 model ,I am so satisfied!!!", "[Edit after 3 days: Thanks to Appario for replacing the defective monitor. The new monitor is up to the mark with BenQ's trusted and proven old models. The rest of the review below is about a defective unit.]", "I had the impression that BenQ is the unsung hero in the monitor market, providing great monitors at affordable price. I still own one working 15\" beige TFT BenQ monitor from 2004 and a BenQ GW2255 from 2013 both of which have superb display quality. This model GW2270 does not uphold BenQ's old reputation. This one has a topple-safe stand and signal detection time is better, but the display is not great for reading. Adjusting the sharpness, color balance, gamma, disabling AMA, nothing helps to make the display as crisp & sharp as the GW2255 (both were connected through DVI at 1080p). To make matters worse, the right side of the monitor is bleeding light (look at the attached photo carefully) and it is far brighter than the center of the monitor. The bleeding stays the same even if I move 3 meters away, so it is not a VA panel characteristic. The bleeding is less noticeable while watching movies.", "It has dual HDMI ports and a VGA port and a stereo out. You can use this as a smart tv through chrome or prime stick provided if you connect audio port to a small sound bar. The only doubt i had is whether it's really a led monitor. No where it is written as led and in manual it is written as LCD display only. Black is not displayed as clear black. It's bit greyish", "I have never seen such a blurred display in my life..The reason this monitor was sold at such a low price is because of its pathetic display...horrible colours and very poor sharpness..my 10 year old samsung moniter had better sharpness than this..returned this product not worth it at all..", "After I bought it, the price dropped by 1000 rupees.", "Good monitor. Sharp. Handles gaming and text well, at least at my level of use. Some advanced options like hue and saturation are disabled in the monitor settings.", "And this is a 2 year old product. Made in 2016.", "Satisfied. But thinking that I may have chosen something better at a cheaper rate if I had more experience in purchasing hardware.", "Pros :", "1. Sturdy and good looking monitor", "2. Good on eyes.", "Cons :", "1. Very weak speakers", "2. Colors look washed out compared to IPS displays. Best for office purposes, not for media and gaming.", "The best monitor to buy, it's sturdy and strong. Unlike most of the monitors this monitor favors sturdiness rather than sleekness which is a good thing. It's better to have a slightly thick monitor than super thin monitor which had to be kept like a glass sheet which could get damages with even a slight impact.", "And when it comes to picture quality and brightness everything is up to the mark", "This monitor has a VA panel I think which is better than an IPS panel because the blacks on this monitor looks way black than any other IPS monitor.", "THIS IS A TOP CLASS PRODUCT. JUST GO FOR IT"], "description": ["Screen Size: 21.5 inch (54.6 cm) Full HD (1920 X 1080) Slim Bezel VA Panel", "Connectivity Port: 1 VGA Port, 2 HDMI Ports", "Aspect Ratio: 16:9, Brightness (Typical): 250 cd/m²", "Refresh Rate: 60 Hz, Response Time: 5 ms", "Viewing Angle: 178 degree horizontal 178 degree vertical", "Flicker Free Technology: Yes, Low Blue Light Technology: Yes"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71iyrFUktHL._SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/71iyrFUktHL._SL1500_.jpg", "path": "full/3abd3a6809fa24dae8982f3d46df86a405a2fccc.jpg", "checksum": "fd4b3fe7bf08cf495279cf12cd9c047b"}]},
{"title": "Acer KG241QP 23.6\" 1 MS 144 Hz Gaming Monitor - 300nits - 2xHDMI 1xDisplayport - AMD Free Sync", "brand": "Acer", "rating": "4.2 out of 5 stars", "price": "₹ 13,499.00", "colour": "not defined", "instock": true, "reviews": [" Its a great budget gaming monitor. If you want to enter the 144hz world, trust me, go ahead. You'll never look back to 60hz again.", "If you want to first see what is the difference between 60 and 144hz. There's a small clip attached which can help you see the difference. The left monitor in the video is 60hz and right one is acer 144hz. You can see how much more cursors you can see on the right one as compared to the left one. This makes a huge difference when gaming as sharpness and blurriness goes away in fast paced games.", "First of all, Its price. Its damn good for its features and quality. Its only and only for gaming purporse. Casual colour correction can be done but its not great. Its great for its price but if you want or prefer colours over smoothness. Go ahead for an IPS monitor. This is an TN panel and should never be used other than straight one person view. Huge colour shift at extreme angles but you'll not play games like that.", "One thing missing is the stand is not height or pivot adjustable. You can just tilt the monitor up and down but you can easily go for a vesa mount to do that later if you want to. Some sacrifices for this price.", "Bezels are quite thick in this monitor. You can see in the attached pic.", "There are two hdmi and one displayport available. I ordered a displayport as it was not in the box. One hdmi cable is provided in the box. There is no headphone jack available in this monitor.", "And I have attached it to my pc which also has 60hz monitor. Some people speculate that different refresh rate monitor can create issues but trust me it doesn't. All things have a way around it.", "It is freesync enables and as nvidia has allowed to run variable refresh rate(g sync) on any freesync monitor. It doesn't matter if you are running a nvidia gpu or not. Freesync will work smoothly without any issues whatsoever.", "It also has a VRB option which uses screen flickering for less blur but reduces brightness and disables freesync. Its quite good but is not good for your eyes for longer period of time.", "It also has overdrive feature which forces each pixel to refresh faster for more sharpness in fast motion but it disables the freesync mode.( if using prefer overdrive at normal and not extreme as extreme introduces ghosting to some extent)", "All things considered. Price, quality, features, its a good package and anyone thinking to enter the 144hz realm should definately look at this budget option.", "For good colours. Prefer brightness at 55, contrast at 42, blackboost 2(should change as per your preference in games), everything else to off in the picture tab", "Gamma at 2.2 and colour at default is good enough for games.", "Happy Gaming", "Alright so it's a 144hz freesync monitor .", "I have used it for almost 3months works like a charm.", "I got it for 14999 which is a great price for a 144hz monitor it's quite the cheapest and performance wise it's awesome.", "You can buy this monitor even if you have a nvdia graphic card as they have created a program that's supports gsync in a free sync monitor.", "Gysync monitors are very expensive as compared to freesync ones.", "i gave negative review at first . but . i found out its HDMI 2.0 .  the brightness is more than enough . watch hardwareunboxed best color settings for this monitors big brother .. both panels are same . KG251QF . apply the settings . the panel has the best color production as for being a TN .. i am loving this monitor .. CS GO feels So freaking Smooth .", ".also provided your GPU has hdmi 2.0 .. Any new tier gpu will do .. RX 4xx series onwards . and GTX 10xx series from pascal . including GT1030s", " Superb panel ..", "The monitor is good. Don't expect too much from this as it is a TN panel monitor. Comes with 1m gtg 144hz refresh rate. Overdrive mode is awesome for competitive gaming. Bang for buck product.", "I Bought This For 13700 Which Is Best Price If You Are Getting 144hz and The Screen Is Perfect For Gaming,Movies And Working Stuff There Are Different Modes In Display Which Enhances Experience.", "Pros:", "1) Value For Money", "2) Perfect Package For Gaming", "3) Very Smooth Display Without Any Dead Pixels And Looks Bright", "4) It Is Not True 1ms Response Time I Take The Test Is No Input Is Given The It Will Have 1ms- 2ms But If Frequently Input Is Give Like FPS Gaming The Response Time Goes High Upto 7ms-10ms", "Cons:", "1) Wall Mount Is Not Included So Need To Buy Seperate One: Vesa 100x100", "2) To Get 144hz You Need To Use DisplayPort 1.2+ Cable Which Is Not Included In Box.", "Overall Worth To Buy Product.", "Go For It", "I got this one,  first impression was smoothness after turning it to 144 hz with over drive mode extreme,  no ghosting,  fast response in apex legends,  it's really noticable from my old 75 hz to 144 hz,  colurs are not that bad of course tn panels dnt hve that colour accuracy like ips panels but for gaming u dont need that much colour as it hurts eyes with higher colour detail,  I given 4 stars because of bezells this display had.  U can have it for sure if u play games and watch movies for lng time,  it's free sync and g sync supported.  But use display caple for higher smooth ness in games.  Display port is also not available in package.  Of course we can't take into consideration at this point overall it's a great monitor for gamera", "Reverting it to 4 stars. Now It's doing 144Hz with the cable provided when paired with an RTX 2060. Make sure your mobo or GPU whichever you are going to connect it to has HDMI 2.0. Games smooth af. cant ask for more for 15K. 4 stars cause the stand was kinda defective. Yet to try G sync i heard someone was able to use it on this monitor. I will update.", "Those who complained about the visual quality being a TN panel, it is not. Such a delite to watch HD movies as well.", "10/10 due to its black booster now you wont miss the enemies hiding in the dark.", "Only suspected con was its panel(TN) but viewing angles aren’t that bad. Only affects vertically and that too if you keep it above your head level.", "Just go for it.. it is worth every penny."], "description": ["23.6\" Full HD (1920 x 1080) Widescreen Display with AMD FreeSync technology", "1MS Response Time 144Hz Refresh Rate 300 Nits Brightness", "2 X HDMI Port 1 X Display Port with Inbox HDMI Cable", "Black Boost with 11 levels of dark level adjustments. Optimize the dark field and see details at a glance", "Wall Mount Option | -5 Degree ~ 15 Degree Tilt Feature", "AMD Free SYNC Technology"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/A18IHKzs0pL._SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/A18IHKzs0pL._SL1500_.jpg", "path": "full/4379b475b5876858c4f8847455b2074e67a1884f.jpg", "checksum": "64e38fdfb046459c3c1bae0f33c25e3b"}]},
{"title": "Lenovo V 19.5 inch (49.53 cm) LCD with LED Backlit lit Computer Monitor - HD, TN Panel with VGA - V20-10 (Black)", "brand": "Lenovo", "rating": "3.9 out of 5 stars", "price": "₹ 4,890.00", "colour": "not defined", "instock": true, "reviews": ["elegant design.", "decent entry level screen", "could gave HDMI too. it could be better", "Product is not good. Shadow lines across display. White background light flashing bottom edge of screen. Returned my product.", "Very good packing like suitcase!", "Great features", "And also picture quality is great", "Brightness is perfect", "5/5", "I like this product. Mostly I use it as an extra screen for my programming and trading and it serves my purpose smoothly.", "Value for money.", "serves the purpose", "Overall the product is good...bt there are some weird wavy texture if you observe the monitor sideways... And not the height adjustable", "All good...", "Really good, it's working as expected.", "Worth buy"], "description": ["Screen Size: 19.5 inches (43.4cm), 1600X900 resolution, TN Panel, 170/160 Viewing Panel", "Connectivity and Ports: VGA", "Aspect Ratio: 16:9 | Contrast Ratio: 1000:1 | Response time: 5ms", "Tilt Angle: -5/22, VESA Mount | Kensington Key Slot | Cable Management | Ambient Light Sensor", "In the box: Monitor with stand, 1 x Power cable, 1 x VGA (1.8m included in box), Quick setup guide"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61UT9xo%2BBcL._SL1165_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/61UT9xo%2BBcL._SL1165_.jpg", "path": "full/2505a556a2e7d8ec19363ee7058d2e329e27ba63.jpg", "checksum": "90914767df05a532f8a5544912559088"}]},
{"title": "BenQ GW2283, 21.5 inch LED Backlit Computer Monitor, Full HD, Borderless, IPS Monitor, Brightness Intelligence Technology, Adaptive Eye Care Technology, Dual HDMI and in-Built Speakers", "brand": "BenQ", "rating": "4.5 out of 5 stars", "price": "₹ 7,895.00", "colour": "not defined", "instock": true, "reviews": ["Bought this monitor on 5th Jan 2018 at Rs. 15,499 in lightning deal", "Following are my observations:", "1) The first thing I noticed is that top and side bezels of the monitor are very thin which is aesthetically pleasing and gives it a premium look.", "2) Screen is decent and has good brightness and contrast. Not sure about color reproduction but it feels alright.", "3) Screen has a refresh rate of 60 Hz at 1920x1080 resolution. However it has an option of 75 Hz at 1024x768 resolution also.", "4) Even though this monitor has Eye Care (Bright Intelligence), I felt that the sensor adjusted brightness is on higher side for my liking.", "5) There is slight backlight bleed at top left corner of monitor which is noticeable only in very dark environments but overall has uniform IPS Glow.", "6) Response time mentioned on the box is 5ms (Gray to Gray) and I felt it to be good for FPS games. Overall, it's a good monitor for casual gaming.", "7) It comes with UK style power cord and needs a converter/adapter or a spike guard will work.", "8) The box also includes HDMI cable and the monitor has cable management as shown in product description which I felt is a nice addition to the package.", "Monitor has following ports:", "D-Sub", "HDMI Port", "Display Port", "Line-in port and", "3.5 mm jack for plugging in earphones", "This monitor also has in-built speakers which are pointed downwards. The quality of audio from them is nothing to brag about and max volume is that of a typical tablet (my iPad Pro 12.9\" 2017 has better sound output than them) but no complaints here considering the price of the monitor.", "Overall this monitor is value for money product considering the price I got it for.", "Cheers to Amazon for on-time delivery.", "Feel free to ask any questions about the product, will be glad to help!", "I bought this product because I edit videos for a living.", "I have a YouTube channel: KTNTECH (You'll find the unboxing and impressions video there)", "If you're a gamer do not go with this one.", "Because it's an IPS Panel the response times are a lil less and there are tad bit jelly effect while gaming.", "If you're a photo/video editor definitely this is for you at least on this budget.", "Thanks for reading.", "Don't forget to check out the channel :)", "I have worked on many monitors (Dell, HP, Acer) in office and home. Never had a Benq. I will get this out of the way, my favourite brand is Dell (I have bought around 10 products). I was torn between the Dell (2717H), Viewsonic and Acer. For some reason I never had a good experience with products of HP.", "My requirement was a 27\" monitor. I am not a serious gamer only play casual games from time to time. The main purpose was to do programming and watching videos (and reading). This monitor suits perfectly.", "Pros:", "- Excellent display. It had a bit of light bleed on top right corner but it was just the glass a bit out. I just pressed it in and the bleed was gone.", "- Good contrast and viewing angles. I have not played any FPS games till now but overall the experience till now (10 days) has been smooth and consistent. The 5ms response time is good enough for me.", "- Although it is a 1080p display, the text and videos appear sharp, no pixelation or ghosting. Colours are uniform and even.", "- Bluelight filtering is good. Helps when reading a long book / article and puts less strain in the eyes.", "Cons:", "- The Eyecare feature is a bit aggressive. The display becomes too bright for the surrounding light. I just switched it to standard and set the brightness and contrast to levels I am comfortable with. The day/night light in my room doesn't differ much so I don't need to change the settings.", "Other monitors with similar features were around or over 20k, I got this for 17k. Overall a very good budget monitor. It also has 3 years warranty which is good and tells that I can expect a pretty long life from this.", "Let me know if you need to know more.", "The BenQ 27 is an amazing monitor the most interesting that I loved about this monitor is its slim bezels on the sides and top. I've connected it with Laptop and the output quality is uncompromised and looks good. it also has an inbuilt speaker (but I never used it because it's not good in my opinion).", "Moreover, the texture on the display is well finished with Matte so it could block glossiness and reflection. The monitor comes with a control panel to adjust different settings related to colors and sound. It also comes with a set of Color schemes preset, which are also customizable. Right beside the control panel buttons, it has a power LED indicator too.", "My overall experience with this monitor is amazing.", "This monitor is really good at this price point ( I got it for 9499 during amazon sale )", "Pros:", "1.Colors are much more Vibrant then normal LED's, i have a triple monitor Setup so i can compare this with other LED's", "  from dell.", "2.Dark and Bright values are much better differentiated.", "3.The best one is the price you cant get any thing better than this at this price Point...Kudos to Benq for that", "4. Brightness is way too much high", "5. Multiple connecting options ( i plugged it to my PC as well as my PS4)", "Cons", "1. There is some back light bleeding ( But that is ok even expensive monitors has minor light bleeds)", "At this price point i think Benq has done a great job.", "if you want a cheap IPS display then this monitor is for you.", "I bought it mainly for its auto brightness. But, the brightness doesn't go too low there is no light around. So, I had to stop using the feature that I especially looked upon. Anyway, it's a value for money product. Good fit for someone who uses it occasionally. Not recommended for you are going to stare at the monitor for around or over 8 hours a day. For such use cases, better to go for Dell ultrasharp monitors. They are costly, but your eyes would thank you for sure."], "description": ["Stunning Full HD Display : Enjoy immaculate image quality with 1920x1080 resolution and 178 degree wide viewing angles", "Edge To Edge Slim Bezel Design:Minimize distractions and create virtually seamless multi-panel configurations", "Dual HDMI Connectivity: 2 HDMI portsoffer convenience to switch between media devices with ease", "Brightness Intelligence Technology: Actively adjusts brightnessaccording to on-screen content and ambient light conditions", "Cable Management System: Neatly hides cables inside the monitor stand", "IPS Wide Viewing Angle Technology", "8-Bit Color Display", "TUV Rheinland Certification", "Flicker-Free Technology", "Green Certification Assurance"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61RUWhzFdkL._SL1400_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/61RUWhzFdkL._SL1400_.jpg", "path": "full/b3386db910cf95d876510eb6c98181cdc9045aaf.jpg", "checksum": "f0b26f7347aa0e7dde538c6320d63b9e"}]},
{"title": "HP 21.5-inch (54.6 cm) Full HD LED Backlit Computer Monitor with IPS Panel - 1CA84AA (Black)", "brand": "HP", "rating": "4.5 out of 5 stars", "price": "₹ 7,299.00", "colour": "not defined", "instock": true, "reviews": ["HP 22w 21.5-inch LED Monitor (Black Onyx)", "I checked the warranty for this before registering it and the warranty had already started from august 2017.", "So on their website it says I have 26 months left, that means the 1 year initial warranty already expired.", "Here's an image of the warranty", "I am writing this review just to explain the little defects of new ips monitors , everyone who bought this monitor congratulations on their purchase. Now go turn of the lights and put a black screen on your monitor if you see little lights comming out of the edges that's called back light bleeding , it's really irritating when you have dark scenes in movies or use it for gamming. Don't confuse the IPS glow with bleeding ,on the image attached shows IPS glow comming from the corners can be fixed with diming the lights or adjusting the angles , but the back light bleed (right top edge not visible due to the phone camera and the IPS glow ) stays there. I have replaced my monitor and have recieved a new one free of cost only to find out the new one has the same issue. I guess I just have to live with it cause I bought it on a budget 5800/- and can't just run around exchanging them for a perfect bleeding free display.", "Good Product... Must have in this price range...", "Received this today and I am very happy with the purchase. Packing was very good by Amazon. The monitor was very easy to assemble and setup with my computer. There was a vga and hdmi cable within the package. Very light weight.", "Very nice product from HP.", "Pros", "1.Good viewing angles.", "2.Accurate color reproduction.", "3.IPS", "4.Antiglare even in front of strong light.", "5.With HDMI and VGA cables.", "6.Blacks are good no colour bleeding.", "7.Hp product with 3 year warranty.", "Cons", "1. No speaker or audio out.", "Verdict.", "No other branded Full hd IPS monitor in 7500 range.So buy confidently.", "Got the monitor in 3 days.  Box was not so good , it looked old but the monitor was in perfect new condition . I plugged in my hp laptop with HDMI and bam , amazing picture quality.  The colours are brilliant. Ive been using it for a day.  Haven't found any issue till now.  Tested pes and 1080p videos are just amazing.  I got it for 7000 and I am very happy .  Love amazon . Of course , LG22MP is better but this has all features in LG22MP , like matte screen , 1080P full HD and low bluelight and nearly bezeless screen.  But no amd freesync which oly gives 75 Hz . HP 22w has 60hz . Which is good enough for gamers also. It has single HDMI and VGA port .  If you are on a budget then get this monitor.", "THIS IS A MUST BUY FOR ANYBODY WANTS PERFECT SHARPNESS IN READING TEXT AND COLORS.", "ITS WORTH THE PRICE DON'T GO FOR ANYTHING CHEAPER AND COMPROMISE IN QUALITY. THIS IS ONE OF THE BEST MONITORS OUT THERE I HAVE EVER USED. JUST PERFECT", "This is a great product from HP. I was thinking of buying a new monitor & read reviews of many monitors and found that this HP 22w (21.5 inch) LED monitor has highest rating in price range less than 10K.", "I got the product at discount at very low price.", "As others have reviewed this product I would like to state that :", "1) The monitor  has very good display.  Amazing picture quality.", "2) Its good for the eyes.  Does not strain your eyes like other monitors", "3) Buttons are very well set at the back of the monitor which makes operating the buttons easy.", "Overall a great product from HP. I am loving it."], "description": ["Screen Size: 21.5 inch (54.6 cm) Full HD (1920 X 1080) IPS Panel", "Connectivity Port: 1 VGA Port, 1 HDMI Port", "Aspect Ratio: 16:9, Brightness (Typical): 250 cd/m²", "Refresh Rate: 60 Hz, Response Time: 5 ms", "Viewing Angle: 178 degree horizontal 178 degree vertical", "Low Blue Light Technology: Yes"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/81o4odmlWEL._SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/81o4odmlWEL._SL1500_.jpg", "path": "full/4a2b24894b4ccfd9f99bc5d4fb11cf8d7af42c41.jpg", "checksum": "74a5057f63a63a7bb3f5ca241f89b466"}]},
{"title": "Acer 19.5-inch (49.53 cm) HD LED Backlit Computer Monitor with HDMI, VGA Ports and Stereo Speakers - V206HQL (Black)", "brand": "Acer", "rating": "3.6 out of 5 stars", "price": "₹ 4,499.00", "colour": "not defined", "instock": true, "reviews": ["The product heading itself is misleading. It is a LCD monitor not an LED one. It has LED back light display only. The product heading is mentioning it has hdmi ports, but it don't have hdmi ports. I have ordered once and found no hdmi ports and ordered for replacement. The replaced item also don't have hdmi ports.", "Complete waist of time buying this product, replacement done twice still no HDMI port. Discription is wrong", "Avg monitor ...not impresseive..display angles are worst. only good thing is u can use it as tv via HDMI ports. External speakers connectivity is there.", "This monitor works as described. The picture quality is decent. The sound is not very loud but it is fine for the person sitting in front of the monitor. I think it is a good value for money monitor, as it comes with built-in speakers which other monitors in the same price range do not offer. (Note: you will need to connect with HDMI cable to get sounds. VGA cable does not transmit sound). I returned the monitor since i realized i wanted a full HD (1080p) monitor and not a HD (720p) one like this.", "Received the monitor well within time . The display was good but the only thing that bothers me is it's sound which is very low.", "I had even put up a service complain to Acer which was promptly attended but nothing could be done as the speaker's are in the back side and you need very good recording to hear the sound clearly.", "I had purchased this monitor because it had inbuilt speakers but it has disappointed me.", "sound quality is not ok..its give very low sound..i had to connect external expeaker. Cannot move the screen up or down once fixed..i mean to say u dont have option to set the position of screen. But its ok for table. The above mentioned are the two issue which i faced, rest every thing i feel good in this product. I took this as I wanted HDMI port to connect to Mini mac and my purpose is served.", "Its  not support resolution  more than 1366*768. Sound speaker is only one watt...so sound is low but sufficient.", "Plus point it VGA + HDMI + Inbuilt speaker that make this product value for money.", "Volume is very low and quality of display is bad. need to view straight, cant go below or above 90Degree"], "description": ["Resolution: HD (1366 x 768) Display", "Aspect Ratio: 16:9, Response Time: 5 ms, Refresh Rate: 60 Hz, Color Supported: 16.7 million, Brightness: 200 nit,", "Viewing Angles : 90° horizontal/ 65° vertical, Panel Type: Twisted Nematic Film (TN Film),", "V6 Series monitors feature Acer eColor technology for striking visuals, and Acer ComfyView innovations that reduce glare to deliver most-comfortable viewing", "With Stereo Speakers", "Power : 16.20 W (operating)/ 450 mW (standby) / 350 mW (off)"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71XCDpSJx5L._SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/71XCDpSJx5L._SL1500_.jpg", "path": "full/cf62a93c907aed8dc625234aeee94335a873e153.jpg", "checksum": "61e4f584862f99a05e8ce3a697729134"}]}
][
{"title": "Envie Infinite AAA 800 2PL Rechargeable Battery", "brand": "Envie", "rating": "3.8 out of 5 stars", "price": "₹ 199.00", "colour": "not defined", "instock": true, "reviews": ["I have purchased these batteries for my trimmer and led flash light. These batteries have a capacity of 2.1AH at 1.2v, ie 2.5 Watt hour. A 1 W flash light should run for 2.5 hours with these ideally.", "Yes, at the first place everything seems working just ok. I tested running the 1w flash light continuously and it ran way longer than with the kit battery which was 700 mah, but not for 2.5 hrs.", "Now coming to the trimmer part, i was using a panasonic trimmer which had an internal battery which was not same as a AA battery, but a modified slightly longer AA battery. I was planning to replace the trimmer battery with this and i sticked a metal cap to elongate the tip and put it in my trimmer. Then only i noticed that the trimmer is running at a lower speed, which indicated that these batteries have a low current capacity. So if you are buying this for a heavy duty equipment like a trimmer, RC car or anything with a motor, i recommend that you go for a costly battery, may be Sony.", "As a quick help to someone who is confused whether to go with a higher capacity battery, remember that NiCd/MH batteries require atleast 4 or 5 cycles of full charge/discharge an year for a good life. In case you are buying this for a mouse or keyboard or any low power devices i recommend that you go with a lower capacity one like 1000 mah or lesser so that you can discharge it completely atleast once in 3 months.", "And another thing which i would like to mention is not to accept any batteries with mfg date beyond 1.5 years. Because these batteries lose their capacity if kept uncharged for a long time. If you got an old battery from a seller, just return it.", "Please hit the Yes button below if i helped you. Thanks", "Bought 2 of the black AAA and 2 of the white AAA envie infinite ready to use. Arrived today. Made in PRC (china). Import date Aug 2017. All 4 cells were about 1.27 V right out of the pack. I put them all through the la crosse charger to test capacity. Charge to full @ 200mA, discharge @ 100mA to test capacity. The black ones were 795 and 799mA. The white ones were 549 and 533mA. So obviously there is a giant difference between the white and black ones. The choice is obvious even accounting for the ~Rs 30 difference per pack. All cells showed about 1.45V after final charge @ 200mA.", "For comparison see my review on the eneloop https://www.amazon.in/gp/review/R2SI37FMZ1RJ1M/ref=pdp_new_read_full_review_link?ie=UTF8", "I want good battery for my DSLR’s flasher, so that I’ve got these in just 180 Rs., I’ve read many bad comments for this but I thought I can spend 180/- for rechargeable batteries.", "One of my friend suggested me to charge these batteries with only NI-CD charger, otherwise it will be leak or damage by other chargers. I’m using these batteries regularly and there is no leakage or damage. I’m able to click more than 250 pictures in single charge. So that enough for me.", "Overall good backup and good batteries.", "Things to see before buying this :", "1. Its 1.2v only that will be not sufficient in some of the products such as AC remote. It will show a dim display in some case.", "2. Works Best for Wireless Keyboard and mouse.", "3. Also works well with TV remotes.", "Bought it for Rs 150. It's a good deal. Thanks Amazon", "Bought in lightning deal....for 199/-", "100% worth purchase..", "I have purchased a toy for my baby girl..as it needs 3 batteries to play music. So purchased it.", "Working well.", "Envie products are good according to price.", "Quality also according to price.", "1000mah batteries.", "Not getting heated.", "Recharged 3 times till now.", "Now a days..Better to use in wall clocks also.....instead of purchasing normal batteries. As they costs 20 rupees each.", "--------------------------------", "Update:19/07/2017:", "One of the battery got liquid leaked. presently it is working fine... lets see", "Star rating 2 points down.", "These batteries leak too much. it worked properly for around a month and a half but now these batteries have started leaking, The batteries do work even though they are leaking but i am afraid to use them with most of my electronics.", "very very bad product only 1 cell is working another 3 not charging .when  i call customer care they give no response and block my mobile no", "this is details of company .this one is fake  company ..i have buy 8 cell at now 5 are not working", "IMS MERCANTILES PVT. LTD.  ", "Electronic parts supplier in Delhi, India", "Address: No.704 7th Floor, Ring Road Mall, Outer Ring Road,, Near Kali Mandir, Sector-3, Rohini, Delhi, 110085", "Hours: Open today · Open 24 hours", "Phone: 085276 40555", "Bought it 3 years ago (mid of 2015, using it now also in 2018). Recharging once in a week; every week for last 3 years. For all these times I am using same battery speaks about the reliability and quality of this battery. Charge retention is still very good and did not find any difference in run time. Highly recommended rechargeable battery. May not be suitable for high amperage devices (those uses more ampere/current per unit of time); but for regular use consumer items, it should be good. Using it for iRobot navigation cube now, used same battery for toys before."], "description": ["Functional design: Set of 2 International Standard universally compatible rechargeable Ni-Mh batteries which can be used straight from the pack without intial charging.", "Capacity:Best in Industry 800mAh capacity batteries with 500+ charge cycles and no memory effect so they can be charged or discharged as needed without loss of capacity", "Discharge: Batteries are equiped with low self dicharge mechanism to hold charge upto 80% for 12 months without use", "Compatibility: Envie AAA Batteries are compatible with numerous devices including Remote Controls, Electronic Toys, Cameras, Flashlights, Torches and various other devices. Batteries also support Quick Charge mechanism which can be done via any smart or quick charger", "Environment friendly:Envie batteries provide you a safe and stable highy protected environment friendly energy solution", "Warranty: Batteries comes with 3 months warranty against poor back up and 1 year warranty against battery leakage. For any query Contact_us on : [ +91-11-47074444]"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71aL7wu4NhL._SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/71aL7wu4NhL._SL1500_.jpg", "path": "full/9c4f169432b3c8906c515425d523058e2ef33e0a.jpg", "checksum": "9dede4c007921e6c5f5e8a29f65a4340"}]},
{"title": "Syska FT2309 Female Precision and Bikini Battery Operated Trimmer (White Pink)", "brand": "SYSKA", "rating": "3.0 out of 5 stars", "price": "₹ 850.00", "colour": "not defined", "instock": true, "reviews": ["Toy product  , does not function as trimmer,  its so slow , and take mutiple roll overs to trim. only suitable for eyebrow , the description of the product is false, have multi use attachments , but too slow to trim. cant expect more with a battery operated product", "Bad product! In terms of quality. It failed to work after one usage. Can't comment more. Customer service is bad. No reply in terms of mail nor toll free number works. Syska! You are bringing bad name to Amazon too.", "Very prompt delivery and good product. I was really searching for a product like this. Very satisfied.  Chandraboli Sen. Kolkata.", "Very bad product...its only trim my hairs & gives poky poky skin...not good for females anymore...i returned ths product.dnt buy", "I have been using this for over 3 months now, and have not faced any issues as yet. Feels very clean and easy to use. Feels worth the price.", "Good", "One of unique product specifically designed for the purpose.", "Excellent product easy to specialy for bikini trimming... Nice product"], "description": ["Washable multi functional personal grooming kit, Removable washable head", "Battery: 2xAAA (not included); non-rechargeable", "Facial and eyebrow trimmer with one guide comb for precise trimming and shaping", "Bikini trimmer with 1 guide comb and 3 lengths defines neckline sideburns precisely and evenly", "For queries please Contact_us on: [ 1800-102-8787 ]"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/41WFn-g09LL._SL1390_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/41WFn-g09LL._SL1390_.jpg", "path": "full/197b3a6c3da2706f9e34e3f0b6a3f4e2e853cff9.jpg", "checksum": "827639444c0593de6f6916009b27ca02"}]},
{"title": "Philips QT4005 Charger 0NLY", "brand": "PHILIPS", "rating": "2.7 out of 5 stars", "price": "₹ 677.00", "colour": "not defined", "instock": true, "reviews": ["It's costlier and company knows that you will buy it.(sic)", "Works perfectly. But it's a bit costly."], "description": ["Easy to use", "Handle with care", "Compatible for all devices"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51QxUl3oTLL._SL1250_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/51QxUl3oTLL._SL1250_.jpg", "path": "full/9a3abf27323a6b17c425a73a563c565e8d829c40.jpg", "checksum": "5bce294dc54761607cf92df04942e48e"}]}
]